Repository: MykolaPrague/profile_site
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: cs, uk

source: Thanks! Your message has been sent.
cs: Díky! Vaše zpráva byla odeslána.
uk: Дякую! Ваше повідомлення надіслано.

source: Portfolio
uk: Портфоліо

source: Profile
cs: Profil
uk: Профіль

source: My projects
cs: Moje projekty
uk: Мої проєкти

source: Contacts
cs: Kontakty
uk: Контакти

source: Ukrainian
cs: Ukrajinština
uk: Українська

source: Czech
cs: Čeština
uk: Чеська

source: English
cs: Angličtina
uk: Англійська

source: Toggle theme
cs: Přepnout téma
uk: Перемкнути тему

source: Menu
uk: Меню

source: %(name)s avatar
cs: Avatar uživatele %(name)s
uk: Аватар %(name)s

source: Hi, my name is %(name)s
cs: Ahoj, jmenuji se %(name)s
uk: Привіт, мене звати Микола Шишка

source: I’m a Prague-based Computer Science graduate 🎓 building lean web apps and prototypes: Python on the backend 👨‍💻 (Flask/Django), HTML/CSS/JS on the frontend, and a growing toolkit of automation and data utilities 🤖📊. I care about readable code, small iterations, and design that stays out of the way ✨. Lately I’ve been exploring applied AI—classification, embeddings, and tiny agents that reduce repetitive work—and sharing lightweight write-ups so others can build on top of my findings.
cs: Jsem pražský 🇨🇿 absolvent informatiky 🎓, který vytváří štíhlé webové aplikace a prototypy: Python na backendu 👨‍💻 (Flask/Django), HTML/CSS/JS na frontendu a rostoucí sadu nástrojů pro automatizaci a práci s daty 🤖📊. Zajímá mě čitelný kód, malé iterace a design, který nepřekáží ✨. V poslední době se věnuji aplikované umělé inteligenci – klasifikaci, embeddingům a malým agentům, kteří snižují opakující se práci – a sdílím jednoduché články, aby ostatní mohli stavět na mých poznatcích.
uk: Я випускник комп’ютерних наук у Празі 🇨🇿 🎓 створюю легкі веб-додатки та прототипи: Python на бекенді 👨‍💻 (Flask/Django), HTML/CSS/JS на фронтенді, а також зростаючий набір інструментів для автоматизації та роботи з даними 🤖📊. Мені важливі читабельний код, невеликі ітерації та дизайн, який не заважає ✨. Останнім часом досліджую прикладний ШІ — класифікацію, ембеддинги та невеликі агенти, що зменшують рутину, — і ділюся короткими нотатками, аби інші могли будувати далі на моїх висновках.

source: Beyond tech, I’m into fishing, long walks with podcasts 🎧, and the occasional street photography 📷. I’m happiest when a simple script unlocks real-world value for someone.
cs: Kromě technologií se věnuji rybaření, dlouhým procházkám s podcasty 🎧 a občasné pouliční fotografii 📷. Nejvíc mě těší, když jednoduchý skript někomu přinese skutečnou hodnotu.
uk: Окрім технологій, люблю риболовлю, довгі прогулянки з подкастами 🎧 та інколи вуличну фотографію 📷. Найбільше тішуся, коли простий скрипт приносить комусь реальну користь.

source: Thanks for stopping by.
cs: Děkuji, že jste se zastavili.
uk: Дякую, що завітали.

source: Let’s build something useful together.
cs: Pojďme společně vytvořit něco užitečného.
uk: Створімо разом щось корисне.

source: View projects
cs: Zobrazit projekty
uk: Переглянути проєкти

source: Contact
cs: Kontakt
uk: Зв’язатися

source: Python / Flask / Django · CRM mini-projects · Simple and practical web tools · AI-curious
cs: Python / Flask / Django · CRM mini-projekty · Jednoduché a praktické webové nástroje · zájem o AI
uk: Python / Flask / Django · міні-проєкти CRM · прості та практичні веб-інструменти · цікавість до ШІ

source: Fishlog (Django) – demo
cs: Fishlog (Django) – ukázka
uk: Fishlog (Django) – демо

source: CRM Mini (Flask) – demo/description
cs: CRM Mini (Flask) – ukázka/popis
uk: CRM Mini (Flask) – демо/опис

source: Simple Web
cs: Jednoduchý web
uk: Простий веб

source: For collaborations, freelance work, or just to say hi—reach out anytime.
cs: Pro spolupráci, zakázky na volné noze nebo jen pro pozdrav – kontaktujt
uk: Для співпраці, фрилансу чи просто привітатися — пишіть у будь-який час.

source: Support
cs: Podpořit
uk: Підтримати

source: Name
cs: Jméno
uk: Ім'я

source: Message
cs: Zpráva
uk: Повідомлення

source: Your website (leave empty)
cs: Vaše webová stránka (nevyplňujte)
uk: Ваш сайт (не заповнюйте)

source: Send
cs: Odeslat
uk: Надіслати

source: Prague, Czechia
cs: Praha, Česko
uk: Прага, Чехія

source: Mon–Fri, 09:00–17:00 CET
cs: Po–Pá, 09:00–17:00 SEČ
uk: Пн–Пт, 09:00–17:00 CET
